app/views/movies/show.html.slim

          = theatre.name
      - theatre.screenings.where(movie_id: @movie.id).each do |screening|
        .col-sm-4.mb-5
          .card
            .card-body
---
SELECT "screenings".* FROM "screenings" WHERE "screenings"."theatre_id" = ? AND "screenings"."movie_id" = ?  [["theatre_id", 3], ["movie_id", 1]]