app/controllers/bookings_controller.rb

SELECT "screenings".* FROM "screenings" WHERE "screenings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def new
		@screening = Screening.find(params[:screening_id])

INSERT INTO "bookings" ("user_id", "screening_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["screening_id", 77], ["created_at", "2021-02-02 16:18:31.660765"], ["updated_at", "2021-02-02 16:18:31.660765"]]
INSERT INTO "bookings" ("user_id", "screening_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["screening_id", 77], ["created_at", "2021-02-02 14:10:20.278668"], ["updated_at", "2021-02-02 14:10:20.278668"]]
INSERT INTO "seats" ("seat_number", "booking_id", "screening_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["seat_number", 8], ["booking_id", 10], ["screening_id", 77], ["created_at", "2021-02-02 16:18:31.704200"], ["updated_at", "2021-02-02 16:18:31.704200"]]
---
	def create
		@booking = Booking.new(
									user_id: current_user.id,
									screening_id: params[:screening_id]
								)
		if @booking.save
			seats = JSON.parse params[:seats]
			seats.each do |number|
				@booking.seats.create!(seat_number: number, screening_id: params[:screening_id])