app/controllers/reports_controller.rb

  def index
    CSV.open('reports.csv', 'w') do |csv|
      csv << ["Movie", "Theater", "Show Time", "Seat No", "Booked By"]
      Booking.includes(:seats).each do |b|
---
SELECT "bookings".* FROM "bookings"
SELECT "seats".* FROM "seats" WHERE "seats"."booking_id" IN (?, ?, ?)  [["booking_id", 5], ["booking_id", 6], ["booking_id", 7]]