app/models/seat.rb

SELECT "seats"."seat_number" FROM "seats" WHERE "seats"."screening_id" = ?  [["screening_id", 77]]
---
  scope :booked_seat_for_screen, lambda {|screen_id|
    select(:seat_number).where(screening_id: screen_id).map(&:seat_number)